MaksymSolovianchyk/stm-tracker/code/STM32N6/Application/STM32N6570-DK/Src/main.c
static void IAC_Config(void)
{
  __HAL_RCC_IAC_CLK_ENABLE();
  __HAL_RCC_IAC_FORCE_RESET();
  __HAL_RCC_IAC_RELEASE_RESET();
}

void IAC_IRQHandler(void)
{
  while (1)
  {
  }
}

/**
 * @brief Draw a rectangle with a given border thickness
 *
 * @param x       top-left X position in pixels
 * @param y       top-left Y position in pixels
 * @param w       width in pixels
 * @param h       height in pixels
 * @param color   ARGB color
 * @param thickness  border thickness in pixels
 */
static void DrawThickRect(uint32_t x, uint32_t y,
                           uint32_t w, uint32_t h,
                           uint32_t color, uint32_t thickness)
{
  for (uint32_t t = 0; t < thickness; t++)
  {
    /* Each iteration draws a slightly smaller rectangle inside the previous.
     * Safety check ensures the rectangle does not collapse inward. */
    if ((w > 2*t) && (h > 2*t))
    {
      UTIL_LCD_DrawRect(x + t, y + t, w - 2*t, h - 2*t, color);
    }
  }
}

/**
 * @brief Draw a filled circle
 *
 * @param cx      center X in pixels
 * @param cy      center Y in pixels
 * @param radius  radius in pixels
 * @param color   ARGB color
 */
static void DrawFilledCircle(uint32_t cx, uint32_t cy,
                              uint32_t radius, uint32_t color)
{
  int32_t r = (int32_t)radius;

  for (int32_t dy = -r; dy <= r; dy++)
  {
    /* For each row, compute horizontal span using Pythagoras:
     * x² + y² = r²  →  x = sqrt(r² - y²) */
    int32_t dx = (int32_t)sqrtf((float32_t)(r*r - dy*dy));

    int32_t x0 = (int32_t)cx - dx;
    int32_t y0 = (int32_t)cy + dy;

    /* Clamp to screen boundaries */
    if (x0 < 0) x0 = 0;
    if (y0 < 0 || y0 >= (int32_t)SCREEN_HEIGHT) continue;
    if ((x0 + 2*dx) > (int32_t)SCREEN_WIDTH)
      dx = (int32_t)SCREEN_WIDTH - x0;

    /* Draw one horizontal line across the circle at this row */
    UTIL_LCD_DrawHLine((uint32_t)x0, (uint32_t)y0, (uint32_t)(2*dx), color);
  }
}

/**
 * @brief Display Neural Network output with a fixed-size tracking rectangle.
 *        The rectangle follows the detected person but never changes size.
 *
 * @param p_postprocess  pointer to postprocessing output
 * @param inference_ms   inference time in ms
 */
static void Display_NetworkOutput(od_pp_out_t *p_postprocess, uint32_t inference_ms)
{
  od_pp_outBuffer_t *rois = p_postprocess->pOutBuff;
  uint32_t nb_rois = p_postprocess->nb_detect;
  int ret;
  int person_found = 0;

  ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc,
          (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
  assert(ret == HAL_OK);

  /* Clear previous frame overlay */
  UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0,
                    lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000);

  for (int32_t i = 0; i < nb_rois; i++)
  {
    /* -----------------------------------------------------------------------
     * Use YOLO center point to position the box, but use FIXED_BOX_W/H
     * so the rectangle never changes size regardless of detection size.
     * ----------------------------------------------------------------------- */

    /* Convert normalized center (0..1) to screen pixels */
    int32_t center_x_px = (int32_t)(rois[i].x_center * (float32_t)lcd_bg_area.XSize)
                           + (int32_t)lcd_bg_area.X0;
    int32_t center_y_px = (int32_t)(rois[i].y_center * (float32_t)lcd_bg_area.YSize)
                           + (int32_t)lcd_bg_area.Y0;

    /* Compute top-left corner from center and fixed size */
    int32_t x0 = center_x_px - (int32_t)(FIXED_BOX_W / 2);
    int32_t y0 = center_y_px - (int32_t)(FIXED_BOX_H / 2);

    /* Clamp so the box never goes outside the screen */
    if (x0 < 0) x0 = 0;
    if (y0 < 0) y0 = 0;
    if (x0 + (int32_t)FIXED_BOX_W > (int32_t)SCREEN_WIDTH)
      x0 = (int32_t)SCREEN_WIDTH - (int32_t)FIXED_BOX_W;
    if (y0 + (int32_t)FIXED_BOX_H > (int32_t)SCREEN_HEIGHT)
      y0 = (int32_t)SCREEN_HEIGHT - (int32_t)FIXED_BOX_H;

    /* Draw fixed-size rectangle centered on the detected person */
    DrawThickRect((uint32_t)x0, (uint32_t)y0,
                   FIXED_BOX_W, FIXED_BOX_H,
                   UTIL_LCD_COLOR_RED, ZONE_BORDER_THICK);

    /* Draw dot at the exact detection center */
    DrawFilledCircle((uint32_t)center_x_px, (uint32_t)center_y_px,
                      DOT_RADIUS, DOT_COLOR);

    person_found = 1;
  }

  /* HUD text */
  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCDEx_PrintfAt(0, LINE(2), CENTER_MODE,
                       person_found ? "PERSON DETECTED" : "               ");
  UTIL_LCDEx_PrintfAt(0, LINE(20), CENTER_MODE, "Inference: %ums", inference_ms);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  ret = HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2);
  assert(ret == HAL_OK);
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

static void LCD_init(void)
{
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Preview layer Init */
  LayerConfig.X0          = lcd_bg_area.X0;
  LayerConfig.Y0          = lcd_bg_area.Y0;
  LayerConfig.X1          = lcd_bg_area.X0 + lcd_bg_area.XSize;
  LayerConfig.Y1          = lcd_bg_area.Y0 + lcd_bg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_RGB565;
  LayerConfig.Address     = (uint32_t) lcd_bg_buffer;

  BSP_LCD_ConfigLayer(0, LTDC_LAYER_1, &LayerConfig);

  LayerConfig.X0 = lcd_fg_area.X0;
  LayerConfig.Y0 = lcd_fg_area.Y0;
  LayerConfig.X1 = lcd_fg_area.X0 + lcd_fg_area.XSize;
  LayerConfig.Y1 = lcd_fg_area.Y0 + lcd_fg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_ARGB4444;
  LayerConfig.Address = (uint32_t) lcd_fg_buffer;

  BSP_LCD_ConfigLayer(0, LTDC_LAYER_2, &LayerConfig);
  UTIL_LCD_SetFuncDriver(&LCD_Driver);
  UTIL_LCD_SetLayer(LTDC_LAYER_2);
  UTIL_LCD_Clear(0x00000000);
  UTIL_LCD_SetFont(&Font20);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
}

/**
 * @brief Displays a Welcome screen for the first 4 seconds
 */
static void Display_WelcomeScreen(void)
{
  static uint32_t t0 = 0;
  if (t0 == 0)
    t0 = HAL_GetTick();

